## SQL and SQLite

In [1]:
import sqlite3

In [2]:
##Connect to SQLite database 
connection = sqlite3.connect('example.db')
connection

In [4]:
##Cursor object
#A cursor in database programming (including Python + SQLite) is an object that lets you:
#run SQL queries
#fetch results
#manage the communication between your Python code and the database

cursor = connection.cursor()

In [5]:
##Create a table
cursor.execute('''
               CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT Not Null,
    age INTEGER,
    department TEXT
)
''')

##Commit the changes
connection.commit()

In [6]:
cursor.execute('''
select * from employees
''')

In [7]:
##Insert data into the table
cursor.execute('''
                INSERT INTO employees (name, age, department)
                VALUES ('Alice', 30, 'HR'),
                         ('Bob', 25, 'Engineering'),
                         ('Charlie', 28, 'Marketing')
''')

connection.commit()

In [8]:
##Query the data from the table
cursor.execute('select * from employees')
rows = cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Alice', 30, 'HR')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 28, 'Marketing')

In [11]:
##Update data in the table
cursor.execute('''
                UPDATE employees
                SET age = age + 1, department = 'Influencer '
                WHERE name = 'Alice' 
''')

connection.commit()

In [12]:
##Query the data from the table
cursor.execute('select * from employees')
rows = cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Alice', 32, 'Influencer ')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 28, 'Marketing')

In [14]:
##Delete data from the table
cursor.execute('''
                DELETE FROM employees
                WHERE name = 'Bob'
''')
connection.commit()

In [15]:
##Query the data from the table
cursor.execute('select * from employees')
rows = cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Alice', 32, 'Influencer ')
(3, 'Charlie', 28, 'Marketing')

In [17]:
## Working with sales data 
##Connect to sqlite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

#Create a table for sales data
cursor.execute('''
                CREATE TABLE IF NOT EXISTS sales (
     id INTEGER PRIMARY KEY,
     product_name TEXT Not Null,
     quantity INTEGER,
     price REAL,
     sale_date TEXT
    )
    ''')

#Insert data into the sales table
sales_data = [
    ('Laptop', 5, 999.99, '2024-01-15'),
    ('Smartphone', 10, 499.99, '2024-01-16'),
    ('Tablet', 7, 299.99, '2024-01-17'),
    ('Headphones', 15, 79.99, '2024-01-18'),
    ('Smartwatch', 8, 199.99, '2024-01-19')
]    

cursor.executemany('''
                INSERT INTO sales (product_name, quantity, price, sale_date)
                VALUES (?, ?, ?, ?)
''', sales_data)

connection.commit()

In [19]:
##Query the data from the table
cursor.execute('select * from sales')
rows = cursor.fetchall()

##print the queried data
for row in rows:
    print(row)

(1, 'Laptop', 5, 999.99, '2024-01-15')
(2, 'Smartphone', 10, 499.99, '2024-01-16')
(3, 'Tablet', 7, 299.99, '2024-01-17')
(4, 'Headphones', 15, 79.99, '2024-01-18')
(5, 'Smartwatch', 8, 199.99, '2024-01-19')

In [21]:
##Close the connection 
connection.close()